funlw65/atmega-clib/ATmegaCLib2/latest_atmegaclib2.h
/* *****************************************************************************
 *  BSD License
 *  ATmega-CLib - a BSD library for using GNU toolchain mainly with EvB4.3 and
 *                EvB5.1 boards, but also Arduino, Sanguino, etc...
 *  Portions Copyright:
 *  - (c) 1998 Wouter van Ooijen, http://www.voti.nl/winkel/index.html
 *  - (c) 2004 Robert Krysztof, website's gone
 *  - (c) 2007 Stefan Engelke, http://www.tinkerer.eu/AVRLib/nRF24L01
 *  - (c) 2009 Michael Spiceland, https://code.google.com/p/libarduino/
 *  - (c) 2009 Joep Suijs, http://www.blogger.com/profile/06821529393453332522
 *  - (c) 2009 Vasile Surducan, http://vsurducan.blogspot.com/
 *  - (c) 2010 Bert van Dam, http://members.home.nl/b.vandam/lonely/index.html
 *  - (c) 2010 Paul Stoffregen, http://www.pjrc.com/teensy/td_libs_OneWire.html
 *  - (c) 2010 Chennai Dharmani, http://www.dharmanitech.com
 *  - (c) 2011 Joe Pardue, http://code.google.com/p/avrtoolbox/
 *  - (c) 2011 Martin Thomas, http://www.siwawi.arubi.uni-kl.de/avr-projects/
 *  - (c) 2011 PJRC.COM, LLC - Paul Stoffregen, http://www.pjrc.com/
 *  - (c) 2011 ChaN, http://elm-chan.org/fsw/strf/xprintf.html
 *  - (c) xxxx Aleksander Mielczarek, http://olek.tk/en/rfm12.php
 *  - (c) 2012 Hans-Gert Dahmen, http://www.das-labor.org/wiki/RFM12_library/en
 *  - (c) 2012 Peter Fuhrmann, http://www.das-labor.org/wiki/RFM12_library/en
 *  - (c) 2012 Soeren Heisrath, http://www.das-labor.org/wiki/RFM12_library/en
 *  - (c) 2012 Vasile Guta Ciucur, https://sites.google.com/site/funlw65/
 *  - (c) xxxx Fabian Maximilian Thiele, website's gone
 *
 *******************************************************************************
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *
 *  - Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *  - Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *  - Neither the name of Vasile Guta Ciucur nor the names of
 *    its contributors may be used to endorse or promote products derived from
 *    this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef ATMEGACLIB_H
#define ATMEGACLIB_H
#include <inttypes.h>
#include <stdio.h>
#include <avr/pgmspace.h>
#include <avr/sleep.h>
#include "nRF24L01.h"

// ============== USER ZONE --- DO WHATEVER SETTINGS YOU NEED ==================

// *****************************************************************************
// Enabling/disabling additional functionality
// *****************************************************************************
#define UART_BAUD_RATE     57600 // default is 57600
#define UART_BAUD_SELECT   (F_CPU / (UART_BAUD_RATE * 16L) - 1) //- don't touch
#define ENABLE_SERIAL // Interrupt based, require CONVERSION, conflicts with SERIAL_POLL
//#define ENABLE_SERIAL_POLL // require CONVERSION, conflicts with SERIAL
//#define ENABLE_PWMSERVO    // servo control (conflicts with regular pwm)
//#define ENABLE_PWM         // motor or led control (conflicts with pwmservo)
//#define ENABLE_IR          // infrared receiver, SONY protocol- it use TIMER0 and INT0
//#define ENABLE_FREQMEASURE   // it can use one of TIMER1, TIMER3, TIMER4, TIMER5, affects PWM
//#define IR_DEBOUNCE        // uncomment to debounce IR with a delay
//#define ENABLE_ADC         // analog to digital converter
//#define ENABLE_TWI         // hardware I2C
#define ENABLE_I2C_SOFTWARE // software I2C
#define ENABLE_CONVERSION    // useful for Serial, LCD and 7SEG Display
//#define ENABLE_XPRINTF       // Hmmm...
#define ENABLE_PCF8583     // require CONVERSION and I2C/TWI
//#define ENABLE_ONE_WIRE    // one wire protocol
//#define ENABLE_DS18_2_ // Dallas temperature sensors, require ONE_WIRE
//#define ENABLE_NB_DELAYS // Non-blocking, slotted delays (instead of millis()) using Timer0
//#define ENABLE_MILLIS     // use TIMER0, conflicts with NB_DELAYS
//#define ENABLE_EXTINT // External Interrupt(INT0,INT1,INT2) - not implemented yet.
//#define ENABLE_PCINT   // Pin on Change Interrupt(PCINT) - not implemented yet.
#define ENABLE_LCD         // require CONVERSION
//#define ENABLE_GLCD
//#define ENABLE_7SEG        // starting from one digit, up to eight digits.
//#define ENABLE_ISPPROG     // Use Arduino as ISP Programmer - require SPI, conflict SD_Card
//#define ENABLE_SPI         // hardware SPI (master)
//#define ENABLE_SPI_INT     // hardware SPI use Interrupts
//#define ENABLE_SD_CARD_DEBUG // SD_ and F32_ functions send info on serial console
//#define ENABLE_SD_CARD       // raw SD Card operations; require SPI
//#define ENABLE_FAT32         // require PCF8583, SPI and SD_CARD
//#define ENABLE_RFM12B      // radio comm.- uses TIMER2, requires SPI
//#define ENABLE_GPL_RFM12B //requires SPI, XPRINTF, conflicts with RFM12B and IR
//#define ENABLE_MIRF24     // requires SPI
//#define OPTIMIZE_SPEED
// *****************************************************************************
// End block of "enable/disable" features
// *****************************************************************************

//--
#ifdef ENABLE_XPRINTF
#define _USE_XFUNC_OUT	1	/* 1: Use output functions */
#define	_CR_CRLF		1	/* 1: Convert \n ==> \r\n in the output char */

#define _USE_XFUNC_IN	0	/* 1: Use input function */
#define	_LINE_ECHO		1	/* 1: Echo back input chars in xgets function */
#endif
//--
//Slotted delays
#ifdef ENABLE_NB_DELAYS
//the following define the number of non-blocking delays.
// set it to the required number of non-blocking delays you need.
#define DELAY_SLOTS  3 // the number of non-blocking delays needed by user
int16_t isr_countdowns[DELAY_SLOTS];
#endif

