funlw65/atmega-clib/ATmegaCLib2/latest_atmegaclib2.h
	//if receive mode is not disabled (default)
#if !(RFM12_TRANSMIT_ONLY)
	//! the number of the currently used in receive buffer.
	uint8_t buffer_in_num;

	//! the number of the currently used out receive buffer.
	uint8_t buffer_out_num;
#endif /* !(RFM12_TRANSMIT_ONLY) */

#if RFM12_PWRMGT_SHADOW
//! Power management shadow register.
/** The wakeup timer feature needs to buffer the current power management state. */
uint16_t pwrmgt_shadow;
#endif

#if RFM12_LOW_BATT_DETECTOR
//! Low battery detector status.
/** \see \ref batt_states "States for the low battery detection feature",
 * as well as rfm12_set_batt_detector() and rfm12_get_batt_status()
 */
volatile uint8_t low_batt;
#endif /* RFM12_LOW_BATT_DETECTOR */

#if RFM12_USE_WAKEUP_TIMER
//! Wakeup timer flag.
/** The wakeup timer feature sets this flag from the interrupt on it's ticks */
volatile uint8_t wkup_flag;
#endif

#if RFM12_LIVECTRL
uint16_t rxctrl_shadow;
uint16_t afc_shadow;
uint16_t txconf_shadow;
uint16_t cfg_shadow;
#endif
} rfm12_control_t;

/************************
 * GLOBALS
 */

//Buffer and status for the message to be transmitted
extern rf_tx_buffer_t rf_tx_buffer;

//if receive mode is not disabled (default)
#if !(RFM12_TRANSMIT_ONLY)
//buffers for storing incoming transmissions
extern rf_rx_buffer_t rf_rx_buffers[2];
#endif /* !(RFM12_TRANSMIT_ONLY) */

//the control struct
extern rfm12_control_t ctrl;

/************************
 * INLINE FUNCTIONS
 */

//if receive mode is not disabled (default)
#if !(RFM12_TRANSMIT_ONLY)
//! Inline function to return the rx buffer status byte.
/** \returns STATUS_FREE or STATUS_COMPLETE
 * \see \ref rxtx_states "rx buffer states", rfm12_rx_len(), rfm12_rx_type(), rfm12_rx_buffer(), rfm12_rx_clear() and rf_rx_buffer_t
 */
static inline uint8_t rfm12_rx_status(void) {
	return rf_rx_buffers[ctrl.buffer_out_num].status;
}

//! Inline function to return the rx buffer length field.
/** \returns The length of the data inside the buffer
 * \see rfm12_rx_status(), rfm12_rx_type(), rfm12_rx_buffer(), rfm12_rx_clear() and rf_rx_buffer_t
 */
static inline uint8_t rfm12_rx_len(void) {
	return rf_rx_buffers[ctrl.buffer_out_num].len;
}

//! Inline function to return the rx buffer type field.
/** \returns The packet type from the packet header type field
 * \see rfm12_rx_status(), rfm12_rx_len(), rfm12_rx_buffer(), rfm12_rx_clear() and rf_rx_buffer_t
 */
static inline uint8_t rfm12_rx_type(void) {
	return rf_rx_buffers[ctrl.buffer_out_num].type;
}

//! Inline function to retreive current rf buffer contents.
/** \returns A pointer to the current receive buffer contents
 * \see rfm12_rx_status(), rfm12_rx_len(), rfm12_rx_type(), rfm12_rx_clear() and rf_rx_buffer_t
 */
static inline uint8_t *rfm12_rx_buffer(void) {
	return (uint8_t*) rf_rx_buffers[ctrl.buffer_out_num].buffer;
}
#endif /* !(RFM12_TRANSMIT_ONLY) */

/************************
 * amplitude modulation receive mode
 */

#if RFM12_RECEIVE_ASK
/** \name States and buffer size for the amplitude modulated receive feature.
 * \anchor ask_defines
 * \note You need to define RFM12_RECEIVE_ASK as 1 to enable this.
 * \see rfrxbuf_t and ISR(ADC_vect, ISR_NOBLOCK)
 * @{
 */
//! The ASK receive buffer size.
#define RFM12_ASK_RFRXBUF_SIZE 55
//! The ASK receive buffer is empty.
#define RFM12_ASK_STATE_EMPTY 0
//! The ASK receive buffer is active.
#define RFM12_ASK_STATE_RECEIVING 1
//! The ASK receive buffer is full.
#define RFM12_ASK_STATE_FULL 2
//@}

//! The receive buffer structure for the amplitude modulated receive feature.
/** \note You need to define RFM12_RECEIVE_ASK as 1 to enable this.
 * \see ask_rxbuf (for further usage instructions) and ISR(ADC_vect, ISR_NOBLOCK)
 * \headerfile rfm12.h
 */
typedef struct {
	//! A pointer into the buffer, used while receiving.
	volatile uint8_t p;

	//! The buffer's state.
	/** \see See \ref ask_defines "ASK mode defines" for a list of possible states */
	volatile uint8_t state;

	//! The data buffer
	uint8_t buf[RFM12_ASK_RFRXBUF_SIZE];
}rfm12_rfrxbuf_t;

//see rfm12_extra.c for more documentation
extern rfm12_rfrxbuf_t ask_rxbuf;

//see rfm12_extra.c for more documentation
void adc_init(void);
#endif /* RFM12_RECEIVE_ASK */

/************************
 * amplitude modulated raw tx mode
 */

#if RFM12_TRANSMIT_ASK
//see rfm12_extra.c for more documentation
void rfm12_ask_tx_mode(uint8_t setting);

//see rfm12_extra.c for more documentation
inline void rfm12_tx_on(void);

//see rfm12_extra.c for more documentation
inline void rfm12_tx_off(void);
#endif /* RFM12_TRANSMIT_ASK  */

/************************
 * rfm12 wakeup timer mode
 */

#if RFM12_USE_WAKEUP_TIMER
//this function sets the wakeup timer register
//(see datasheet for values)
//see rfm12_extra.c for more documentation
void rfm12_set_wakeup_timer(uint16_t val);
#endif /* RFM12_USE_WAKEUP_TIMER */

#if RFM12_USE_POWER_CONTROL
void rfm12_power_down();
void rfm12_power_up();
#endif

/************************
 * rfm12 low battery detector mode
 */

#if RFM12_LOW_BATT_DETECTOR
/**\name States for the low battery detection feature.
 * \anchor batt_states
 * \see rfm12_set_batt_detector() and rfm12_get_batt_status()
 * @{
 */
//! Battery voltage is okay.
#define RFM12_BATT_OKAY 0
//! Low battery voltage detected.
#define RFM12_BATT_LOW 1
//@}

//this function sets the low battery detector and microcontroller clock divider register
//(see datasheet for values)
//see rfm12_extra.c for more documentation
void rfm12_set_batt_detector(uint16_t val);

//return the battery status
//see rfm12_extra.c for more documentation
uint8_t rfm12_get_batt_status(void);
#endif /* RFM12_LOW_BATT_DETECTOR */

typedef struct {
	uint16_t rfm12_hw_command; //actual SPI command for rfm12
	uint16_t rfm12_hw_parameter_mask; //mask that selects valid bits for this parameter
	uint16_t *shadow_register; //pointer to the shadow register to be used for this command
	uint16_t current_value;

