funlw65/atmega-clib/ATmegaCLib2/latest_atmegaclib2.h
#if RFM12_LIVECTRL_CLIENT
//these are for the client
uint16_t min_val;
uint16_t max_val;
int16_t step;
char *name;
void (*to_string)(char *str, uint16_t value);
#endif
} livectrl_cmd_t;

extern livectrl_cmd_t livectrl_cmds[];

//these constants have to be in the same order as the elemts in the table
//livectrl_cmds
#define RFM12_LIVECTRL_BASEBAND   0
#define RFM12_LIVECTRL_XTAL_LOAD  1
#define RFM12_LIVECTRL_FREQUENCY  2
#define RFM12_LIVECTRL_DATARATE   3
#define RFM12_LIVECTRL_TX_POWER   4
#define RFM12_LIVECTRL_FSK_SHIFT  5
#define RFM12_LIVECTRL_LNA        6
#define RFM12_LIVECTRL_RSSI       7
#define RFM12_LIVECTRL_FILTER_BW  8

#define NUM_LIVECTRL_CMDS         9

void rfm12_livectrl(uint8_t cmd, uint16_t value);

void rfm12_save_settings();
void rfm12_load_settings();

#if RFM12_LIVECTRL_CLIENT
void rfm12_livectrl_get_parameter_string(uint8_t cmd, char *str);
#endif

/* Configuration setting command
 Bit el enables the internal data register.
 Bit ef enables the FIFO mode. If ef=0 then DATA (pin 6) and DCLK (pin 7) are used for data and data clock output.
 x3 x2 x1 x0 Crystal Load Capacitance [pF]
 0 0 0 0 8.5
 0 0 0 1 9.0
 0 0 1 0 9.5
 0 0 1 1 10.0
 ....
 1 1 1 0 15.5
 1 1 1 1 16.0
 */
#	define RFM12_CMD_CFG 0x8000
#	define RFM12_CFG_EL 0x80
#	define RFM12_CFG_EF 0x40
#	define RFM12_CFG_BAND_MASK 0x30
#	define RFM12_BAND_315 0x00
#	define RFM12_BAND_433 0x10
#	define RFM12_BAND_868 0x20
#	define RFM12_BAND_915 0x30

#	define RFM12_CFG_XTAL_MASK 0x0F
#	define RFM12_XTAL_8_5PF  0x00
#	define RFM12_XTAL_9_0PF  0x01
#	define RFM12_XTAL_9_5PF  0x02
#	define RFM12_XTAL_10_0PF 0x03
#	define RFM12_XTAL_10_5PF 0x04
#	define RFM12_XTAL_11_0PF 0x05
#	define RFM12_XTAL_11_5PF 0x06
#	define RFM12_XTAL_12_0PF 0x07
#	define RFM12_XTAL_12_5PF 0x08
#	define RFM12_XTAL_13_0PF 0x09
#	define RFM12_XTAL_13_5PF 0x0A
#	define RFM12_XTAL_14_0PF 0x0B
#	define RFM12_XTAL_14_5PF 0x0C
#	define RFM12_XTAL_15_0PF 0x0D
#	define RFM12_XTAL_15_5PF 0x0E
#	define RFM12_XTAL_16_0PF 0x0F

/*
 2. Power Management Command
 Bit Function of the control bit Related blocks
 er Enables the whole receiver chain RF front end, baseband, synthesizer, oscillator
 ebb The receiver baseband circuit can be separately switched on Baseband
 et Switches on the PLL, the power amplifier, and starts the
 transmission (If TX register is enabled) Power amplifier, synthesizer, oscillator
 es Turns on the synthesizer Synthesizer
 ex Turns on the crystal oscillator Crystal oscillator
 eb Enables the low battery detector Low battery detector
 ew Enables the wake-up timer Wake-up timer
 dc Disables the clock output (pin 8) Clock output buffer
 */
#define RFM12_CMD_PWRMGT 0x8200
#define RFM12_PWRMGT_ER 0x80
#define RFM12_PWRMGT_EBB 0x40
#define RFM12_PWRMGT_ET 0x20
#define RFM12_PWRMGT_ES 0x10
#define RFM12_PWRMGT_EX 0x08
#define RFM12_PWRMGT_EB 0x04
#define RFM12_PWRMGT_EW 0x02
#define RFM12_PWRMGT_DC 0x01

/*
 3. Frequency Setting Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 0 1 0 f11 f10 f9 f8 f7 f6 f5 f4 f3 f2 f1 f0 A680h
 The 12-bit parameter F (bits f11 to f0) should be in the range
 of 96 and 3903. When F value sent is out of range, the
 previous value is kept. The synthesizer center frequency f0 can
 be calculated as:
 f0 = 10 * C1 * (C2 + F/4000) [MHz]
 The constants C1 and C2 are determined by
 the selected band as:
 Band [MHz] C1 C2
 433		1 43
 868		2 43
 915		3 30

 Frequency in 433 Band can be from 430.24MHz to 439.7575MHz in 2.5kHz increments.
 */

#define RFM12_CMD_FREQUENCY 0xA000
#define RFM12_FREQUENCY_MASK 0x0FFF
#define RFM12_FREQUENCY_CALC_433(f) (((f)-430000000UL)/2500UL)
#define RFM12_FREQUENCY_CALC_868(f) (((f)-860000000UL)/5000UL)
#define RFM12_FREQUENCY_CALC_915(f) (((f)-900000000UL)/7500UL)

/*
 4. Data Rate Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 0 1 1 0 cs r6 r5 r4 r3 r2 r1 r0 C623h
 The actual bit rate in transmit mode and the expected bit rate of the received data stream in receive mode is determined by the 7-bit
 parameter R (bits r6 to r0) and bit cs.
 BR = 10000 / 29 / (R+1) / (1+cs*7) [kbps]
 In the receiver set R according to the next function:
 R = (10000 / 29 / (1+cs*7) / BR) – 1, where BR is the expected bit rate in kbps.
 Apart from setting custom values, the standard bit rates from 600 bps to 115.2 kbps can be approximated with small error.
 Data rate accuracy requirements:
 Clock recovery in slow mode: ΔBR/BR < 1/(29*Nbit) Clock recovery in fast mode: ΔBR/BR < 3/(29*Nbit)
 BR is the bit rate set in the receiver and ΔBR is the bit rate difference between the transmitter and the receiver. Nbit is the maximum
 number of consecutive ones or zeros in the data stream. It is recommended for long data packets to include enough 1/0 and 0/1
 transitions, and to be careful to use the same division ratio in the receiver and in the transmitter.
 */

#define RFM12_CMD_DATARATE 0xC600
#define RFM12_DATARATE_CS 0x80
//calculate setting for datarates >= 2700 Baud
#define RFM12_DATARATE_CALC_HIGH(d) ((uint8_t)((10000000.0/29.0/d)-0.5))
//calculate setting for datarates < 2700 Baud
#define RFM12_DATARATE_CALC_LOW(d) (RFM12_DATARATE_CS|(uint8_t)((10000000.0/29.0/8.0/d)-0.5))
#define RFM12_DATARATE_MASK 0x00ff

/*
 5. Receiver Control Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 0 0 1 0 p16 d1 d0 i2 i1 i0 g1 g0 r2 r1 r0 9080h
 Bit 10 (p16): pin16 function select

 p16 Function of pin 16
 0 Interrupt input
 1 VDI output

 Bits 9-8 (d1 to d0): VDI (valid data indicator) signal response time setting:
 d1 d0 Response
 0 0 Fast
 0 1 Medium
 1 0 Slow
 1 1 Always on

 Bits 7-5 (i2 to i0): Receiver baseband bandwidth (BW) select:
 i2 i1 i0 BW [kHz]
 0 0 0 reserved
 0 0 1 400
 0 1 0 340
 0 1 1 270
 1 0 0 200
 1 0 1 134
 1 1 0 67
 1 1 1 reserved
 Bits 4-3 (g1 to g0): LNA gain select:
 g1 g0 relative to maximum [dB]
 0 0 0
 0 1 -6
 1 0 -14
 1 1 -20

 Bits 2-0 (r2 to r0): RSSI detector threshold:
 r2 r1 r0 RSSIsetth [dBm]
 0 0 0 -103
 0 0 1 -97
 0 1 0 -91
 0 1 1 -85
 1 0 0 -79
 1 0 1 -73
 1 1 0 Reserved
 1 1 1 Reserved
 The RSSI threshold depends on the LNA gain, the real RSSI threshold can be calculated:
 RSSIth=RSSIsetth+GLNA

 */

#define RFM12_CMD_RXCTRL 0x9000
#define RFM12_RXCTRL_P16_VDI 0x400
#define RFM12_RXCTRL_VDI_FAST 0x000
#define RFM12_RXCTRL_VDI_MEDIUM 0x100
#define RFM12_RXCTRL_VDI_SLOW 0x200
#define RFM12_RXCTRL_VDI_ALWAYS_ON 0x300

#define RFM12_RXCTRL_BW_MASK 0xE0
#define RFM12_RXCTRL_BW_400 0x20
#define RFM12_RXCTRL_BW_340 0x40
#define RFM12_RXCTRL_BW_270 0x60
#define RFM12_RXCTRL_BW_200 0x80
#define RFM12_RXCTRL_BW_134 0xA0
#define RFM12_RXCTRL_BW_67 0xC0

#define RFM12_RXCTRL_LNA_MASK 0x18
#define RFM12_RXCTRL_LNA_0 0x00
#define RFM12_RXCTRL_LNA_6 0x08
#define RFM12_RXCTRL_LNA_14 0x10
#define RFM12_RXCTRL_LNA_20 0x18

