funlw65/atmega-clib/ATmegaCLib2/latest_atmegaclib2.h
#define RFM12_RXCTRL_RSSI_103 0x00
#define RFM12_RXCTRL_RSSI_97 0x01
#define RFM12_RXCTRL_RSSI_91 0x02
#define RFM12_RXCTRL_RSSI_85 0x03
#define RFM12_RXCTRL_RSSI_79 0x04
#define RFM12_RXCTRL_RSSI_73 0x05
#define RFM12_RXCTRL_RSSI_67 0x06
#define RFM12_RXCTRL_RSSI_61 0x07
#define RFM12_RXCTRL_RSSI_MASK 0x07

/*
 6. Data Filter Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 0 0 1 0 al ml 1 s 1 f2 f1 f0 C22Ch

 Bit 7 (al): Clock recovery (CR) auto lock control, if set.
 CR will start in fast mode, then after locking it will automatically switch to slow mode.

 Bit 6 (ml): Clock recovery lock control
 1: fast mode, fast attack and fast release (4 to 8 bit preamble (1010...) is recommended)
 0: slow mode, slow attack and slow release (12 to 16 bit preamble is recommended)
 Using the slow mode requires more accurate bit timing (see Data Rate Command).

 Bits 4 (s): Select the type of the data filter:
 s Filter Type
 0 Digital filter
 1 Analog RC filter
 Digital: This is a digital realization of an analog RC filter followed by a comparator with hysteresis. The time constant is
 automatically adjusted to the bit rate defined by the Data Rate Command.
 Note: Bit rate can not exceed 115 kpbs in this mode.
 Analog RC filter: The demodulator output is fed to pin 7 over a 10 kOhm resistor. The filter cut-off frequency is set by the
 external capacitor connected to this pin and VSS.

 Bits 2-0 (f2 to f0): DQD threshold parameter.
 Note: To let the DQD report "good signal quality" the threshold parameter should be 4 in cases where the bitrate is close to the
 deviation. At higher deviation/bitrate settings, a higher threshold parameter can report "good signal quality" as well.
 */

#define RFM12_CMD_DATAFILTER 0xC228
#define RFM12_DATAFILTER_AL 0x80
#define RFM12_DATAFILTER_ML 0x40
#define RFM12_DATAFILTER_S 0x10

/*
 7. FIFO and Reset Mode Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 1 0 1 0 f3 f2 f1 f0 sp al ff dr CA80h

 Bits 7-4 (f3 to f0): FIFO IT level. The FIFO generates IT when the number of received data bits reaches this level.

 Bit 3 (sp): Select the length of the synchron pattern:
 sp		Byte1		Byte0 (POR) 	Synchron Pattern (Byte1+Byte0)
 0		2Dh			D4h				2DD4h
 1		Not used	D4h				D4h
 Note: Byte0 can be programmed by the Synchron Pattern Command.

 Bit 2 (al): Set the input of the FIFO fill start condition:
 al
 0 Synchron pattern
 1 Always fill

 Bit 1 (ff): FIFO fill will be enabled after synchron pattern reception. The FIFO fill stops when this bit is cleared.
 Bit 0 (dr): Disables the highly sensitive RESET mode.

 */
#define RFM12_CMD_FIFORESET 0xCA00
#define RFM12_FIFORESET_SP 0x08
#define RFM12_FIFORESET_AL 0x04
#define RFM12_FIFORESET_FF 0x02
#define RFM12_FIFORESET_DR 0x01

/*
 8. Synchron Pattern Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 1 1 1 0 b7 b6 b5 b4 b3 b2 b1 b0 CED4h
 The Byte0 used for synchron pattern detection can be reprogrammed by B <b7:b0>.
 */
#define RFM12_CMD_SYNCPATTERN 0xCE00

/*
 9. Receiver FIFO Read Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 B000h
 With this command, the controller can read 8 bits from the receiver FIFO. Bit 6 (ef) must be set in Configuration Setting Command.

 Note:: During FIFO access fSCK cannot be higher than fref /4, where fref is the crystal oscillator frequency. When the duty-cycle of the
 clock signal is not 50 % the shorter period of the clock pulse width should be at least 2/fref .
 */

#define RFM12_CMD_READ 0xB000

/*
 10. AFC Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 0 1 0 0 a1 a0 rl1 rl0 st fi oe en C4F7h

 Bit 7-6 (a1 to a0): Automatic operation mode selector:
 a1 a0
 0 0 Auto mode off (Strobe is controlled by microcontroller)
 0 1 Runs only once after each power-up
 1 0 Keep the foffset only during receiving (VDI=high)
 1 1 Keep the foffset value independently from the state of the VDI signal

 Bit 5-4 (rl1 to rl0): Range limit. Limits the value of the frequency offset register to the next values:
 rl1 rl0 Max deviation
 0 0 No restriction (+63 fres to -64 fres)
 0 1 +15 fres to -16 fres
 1 0 +7 fres to -8 fres
 1 1 +3 fres to -4 fres
 fres:
 433 MHz bands: 2.5 kHz
 868 MHz band: 5 kHz
 915 MHz band: 7.5 kHz

 Bit 3 (st): Strobe edge, when st goes to high, the actual latest calculated frequency error is stored into the offset register of the AFC
 block.
 Bit 2 (fi): Switches the circuit to high accuracy (fine) mode. In this case, the processing time is about twice as long, but the measurement
 uncertainty is about half.
 Bit 1 (oe): Enables the frequency offset register. It allows the addition of the offset register to the frequency control word of the PLL.
 Bit 0 (en): Enables the calculation of the offset frequency by the AFC circuit.

 In automatic operation mode (no strobe signal is needed from the microcontroller to update the output offset register) the AFC circuit
 is automatically enabled when the VDI indicates potential incoming signal during the whole measurement cycle and the circuit
 measures the same result in two subsequent cycles.
 There are three operation modes, examples from the possible application:
 1, (a1=0, a0=1) The circuit measures the frequency offset only once after power up. This way, extended TX-RX maximum distance
 can be achieved.
 Possible application:
 In the final application, when the user inserts the battery, the circuit measures and compensates for the frequency offset caused by
 the crystal tolerances. This method allows for the use of a cheaper quartz in the application and provides protection against tracking
 an interferer.
 2a, (a1=1, a0=0) The circuit automatically measures the frequency offset during an initial effective low data rate pattern –easier to
 receive- (i.e.: 00110011) of the package and changes the receiving frequency accordingly. The further part of the package can be
 received by the corrected frequency settings.
 2b, (a1=1, a0=0) The transmitter must transmit the first part of the packet with a step higher deviation and later there is a possibility
 of reducing it.
 In both cases (2a and 2b), when the VDI indicates poor receiving conditions (VDI goes low), the output register is automatically
 cleared. Use these settings when receiving signals from different transmitters transmitting in the same nominal frequencies.
 3, (a1=1, a0=1) It’s the same as 2a and 2b modes, but suggested to use when a receiver operates with only one transmitter. After a
 complete measuring cycle, the measured value is kept independently of the state of the VDI signal.
 */

#define RFM12_CMD_AFC 0xC400
#define RFM12_AFC_AUTO_OFF 0x00
#define RFM12_AFC_AUTO_ONCE 0x40
#define RFM12_AFC_AUTO_VDI 0x80
#define RFM12_AFC_AUTO_KEEP 0xC0
#define RFM12_AFC_LIMIT_OFF 0x00 /* 64 */
#define RFM12_AFC_LIMIT_16 0x10
#define RFM12_AFC_LIMIT_8 0x20
#define RFM12_AFC_LIMIT_4 0x30
#define RFM12_AFC_ST 0x08
#define RFM12_AFC_FI 0x04
#define RFM12_AFC_OE 0x02
#define RFM12_AFC_EN 0x01

