funlw65/atmega-clib/ATmegaCLib2/latest_atmegaclib2.h
#if _USE_XFUNC_IN
#define xdev_in(func) xfunc_in = (unsigned char(*)(void))(func)
extern unsigned char (*xfunc_in)(void);
int xgets (char* buff, int len);
int xfgets (unsigned char (*func)(void), char* buff, int len);
int xatoi (char** str, long* res);
#endif
#endif
//--
#ifdef ENABLE_SERIAL // serial with interrupts...
#ifdef USART0_RX_vect // if uC with more than one Serial peripheral ...
#define UART0_ISR_VECT USART0_RX_vect
#elif defined(USART_RXC_vect)
#define UART0_ISR_VECT USART_RXC_vect
#else
#define UART0_ISR_VECT USART_RX_vect
#endif

void serial_init(void);
uint8_t serial_getchar(void);
uint8_t serial_available(void);
void serial_flush(void);
#endif // end Serial
#ifdef ENABLE_SERIAL_POLL
void serial_init(void);
uint8_t serial_getchar(void);
#endif // end Serial Poll
#if defined(ENABLE_SERIAL) || defined(ENABLE_SERIAL_POLL)

#if defined(USART_RXC_vect)
#define UART0_DATA	UDR
#else
#define UART0_DATA	UDR0
#endif

void serial_putchar(uint8_t data);
#define serial_putc(c__) serial_putchar((uint8_t)c__)
void serial_putstr(int8_t *s); // send a string from SRAM
#define serial_puts(s__) serial_putstr((int8_t *)s__)
void serial_putstr_f(int8_t *s); // send a string from Flash memory
#define serial_puts_f(s__) serial_putstr_f((int8_t *)PSTR(s__))
//void serial_putstr_e(uint8_t *s);   // send a string from EEPROM
void serial_putint(int value);
void serial_putU08(uint8_t value); // display a byte
void serial_puthexU08(uint8_t value); // display a byte in hex value
void serial_puthexU16(uint16_t value); // display a word in hex value
void serial_puthexU32(uint32_t value); // display a double in hex value

#define TX_NEWLINE {serial_putc(0x0d); serial_putc(0x0a);}
// required by Dharmani's SD_Card functions...
#endif // ENABLE_SERIAL_POLL
#ifdef ENABLE_IR
#define IR_BUFFER_SIZE		16
void ir_init(void);
uint8_t ir_get(void);
uint8_t ir_get_nonblock(void);
#endif // end IR
#ifdef ENABLE_PWMSERVO
void pwmservo_init(uint8_t pwmno);
void pwmservo_set(uint8_t servo, uint8_t pwmval); /* pwmval 0-255 */
/* 16bit timer counter values for PWM */
#define SERVO_MIN_POS16		1400
#define SERVO_MID_POS16		3000
#define SERVO_MAX_POS16		4600
/* 8bit timer counter values for PWM */
#define SERVO_MIN_POS8		10
#define SERVO_MID_POS8		25
#define SERVO_MAX_POS8		40
#endif

#ifdef ENABLE_PWM
void pwm_init(uint8_t pwmnum);
void pwm_set(uint8_t pwmnum, uint8_t pwmval); /* pwmval 0-255 */
#endif

#ifdef ENABLE_FREQMEASURE
#if defined(CAPTURE_USE_TIMER1)

static uint8_t saveTCCR1A, saveTCCR1B;

static inline void capture_init(void) {
	saveTCCR1A = TCCR1A;
	saveTCCR1B = TCCR1B;
	TCCR1B = 0;
	TCCR1A = 0;
	TCNT1 = 0;
	TIFR1 = (1 << ICF1) | (1 << TOV1);
	TIMSK1 = (1 << ICIE1) | (1 << TOIE1);
}

static inline void capture_start(void) {
	TCCR1B = (1 << ICNC1) | (1 << ICES1) | (1 << CS10);
}

static inline uint16_t capture_read(void) {
	return ICR1;
}

static inline uint8_t capture_overflow(void) {
	return TIFR1 & (1 << TOV1);
}

static inline uint8_t capture_overflow_reset(void) {
	return TIFR1 = (1 << TOV1);
}

static inline void capture_shutdown(void) {
	TCCR1B = 0;
	TIMSK1 = 0;
	TCCR1A = saveTCCR1A;
	TCCR1B = saveTCCR1B;
}

#define TIMER_OVERFLOW_VECTOR  TIMER1_OVF_vect
#define TIMER_CAPTURE_VECTOR   TIMER1_CAPT_vect

#elif defined(CAPTURE_USE_TIMER3)

static uint8_t saveTCCR3A, saveTCCR3B;

static inline void capture_init(void)
{
	saveTCCR3A = TCCR3A;
	saveTCCR3B = TCCR3B;
	TCCR3B = 0;
	TCCR3A = 0;
	TCNT3 = 0;
	TIFR3 = (1<<ICF3) | (1<<TOV3);
	TIMSK3 = (1<<ICIE3) | (1<<TOIE3);
}

static inline void capture_start(void)
{
	TCCR3B = (1<<ICNC3) | (1<<ICES3) | (1<<CS30);
}

static inline uint16_t capture_read(void)
{
	return ICR3;
}

static inline uint8_t capture_overflow(void)
{
	return TIFR3 & (1<<TOV3);
}

static inline uint8_t capture_overflow_reset(void)
{
	return TIFR3 = (1<<TOV3);
}

static inline void capture_shutdown(void)
{
	TCCR3B = 0;
	TIMSK3 = 0;
	TCCR3A = saveTCCR3A;
	TCCR3B = saveTCCR3B;
}

#define TIMER_OVERFLOW_VECTOR  TIMER3_OVF_vect
#define TIMER_CAPTURE_VECTOR   TIMER3_CAPT_vect

#elif defined(CAPTURE_USE_TIMER4)

static uint8_t saveTCCR4A, saveTCCR4B;

static inline void capture_init(void)
{
	saveTCCR4A = TCCR4A;
	saveTCCR4B = TCCR4B;
	TCCR4B = 0;
	TCCR4A = 0;
	TCNT4 = 0;
	TIFR4 = (1<<ICF4) | (1<<TOV4);
	TIMSK4 = (1<<ICIE4) | (1<<TOIE4);
}

static inline void capture_start(void)
{
	TCCR4B = (1<<ICNC4) | (1<<ICES4) | (1<<CS40);
}

static inline uint16_t capture_read(void)
{
	return ICR4;
}

static inline uint8_t capture_overflow(void)
{
	return TIFR4 & (1<<TOV4);
}

static inline uint8_t capture_overflow_reset(void)
{
	return TIFR4 = (1<<TOV4);
}

static inline void capture_shutdown(void)
{
	TCCR4B = 0;
	TIMSK4 = 0;
	TCCR4A = saveTCCR4A;
	TCCR4B = saveTCCR4B;
}

#define TIMER_OVERFLOW_VECTOR  TIMER4_OVF_vect
#define TIMER_CAPTURE_VECTOR   TIMER4_CAPT_vect

#elif defined(CAPTURE_USE_TIMER5)

static uint8_t saveTCCR5A, saveTCCR5B;

static inline void capture_init(void)
{
	saveTCCR5A = TCCR5A;
	saveTCCR5B = TCCR5B;
	TCCR5B = 0;
	TCCR5A = 0;
	TCNT5 = 0;
	TIFR5 = (1<<ICF5) | (1<<TOV5);
	TIMSK5 = (1<<ICIE5) | (1<<TOIE5);
}

static inline void capture_start(void)
{
	TCCR5B = (1<<ICNC5) | (1<<ICES5) | (1<<CS50);
}

static inline uint16_t capture_read(void)
{
	return ICR5;
}

static inline uint8_t capture_overflow(void)
{
	return TIFR5 & (1<<TOV5);
}

static inline uint8_t capture_overflow_reset(void)
{
	return TIFR5 = (1<<TOV5);
}

static inline void capture_shutdown(void)
{
	TCCR5B = 0;
	TIMSK5 = 0;
	TCCR5A = saveTCCR5A;
	TCCR5B = saveTCCR5B;
}

#define TIMER_OVERFLOW_VECTOR  TIMER5_OVF_vect
#define TIMER_CAPTURE_VECTOR   TIMER5_CAPT_vect
#endif // CAPTURE_USE_***
// Main functions
void FreqMeasure_begin(void);
uint8_t FreqMeasure_available(void);
uint32_t FreqMeasure_read(void);
void FreqMeasure_end(void);

