funlw65/atmega-clib/ATmegaCLib2/latest_atmegaclib2.h
#endif //ENABLE_FREQMEASURE
#ifdef ENABLE_ADC
// this is NOT user zone
//define adc voltage reference
#define VREF_OFF_INT_AREF       0
#define VREF_AVCC_CAP_AREF      1
#define VREF_INT_1_1V_CAP_AREF  2
#define VREF_INT_2_56V_CAP_AREF 3
// define adc prescaler
#define ADC_PRESCALER_0   0
#define ADC_PRESCALER_2   1
#define ADC_PRESCALER_4   2
#define ADC_PRESCALER_8   3
#define ADC_PRESCALER_16  4
#define ADC_PRESCALER_32  5
#define ADC_PRESCALER_64  6
#define ADC_PRESCALER_128 7

void adc_init(uint8_t adc_reference, uint8_t adc_prescaler);
uint16_t adc_get(uint8_t adcnum);
void adc_poweroff_digital_pinbuffer(uint8_t adcnum);
#endif //adc
#ifdef ENABLE_LCD
// this is NOT user zone
#ifdef LCD_1X8
#define LCD_COLUMN      8
#define LCD_LINE        1
#define LCD_LINE1       0x80
#endif

#ifdef LCD_1X16
#define LCD_COLUMN      16
#define LCD_LINE        1
#define LCD_LINE1       0x80
#endif

#ifdef LCD_1X20
#define LCD_COLUMN      20
#define LCD_LINE        1
#define LCD_LINE1       0x80
#endif

#ifdef LCD_1X40
#define LCD_COLUMN      40
#define LCD_LINE        1
#define LCD_LINE1       0x80
#endif

#ifdef LCD_2X8
#define LCD_COLUMN      8
#define LCD_LINE        2
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#endif

#ifdef LCD_2X12
#define LCD_COLUMN      12
#define LCD_LINE        2
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#endif

#ifdef LCD_2X16
#define LCD_COLUMN      16
#define LCD_LINE        2
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#endif

#ifdef LCD_2X20
#define LCD_COLUMN      20
#define LCD_LINE        2
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#endif

#ifdef LCD_2X24
#define LCD_COLUMN      24
#define LCD_LINE        2
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#endif

#ifdef LCD_2X40
#define LCD_COLUMN      40
#define LCD_LINE        2
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#endif

#ifdef LCD_4X16
#define LCD_COLUMN      16
#define LCD_LINE        4
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#define LCD_LINE3       (0x80 + 0x10)
#define LCD_LINE4       (0x80 + 0x50)
#endif

#ifdef LCD_4X20
#define LCD_COLUMN      20
#define LCD_LINE        4
#define LCD_LINE1       0x80
#define LCD_LINE2       (0x80 + 0x40)
#define LCD_LINE3       (0x80 + 0x14)
#define LCD_LINE4       (0x80 + 0x54)
#endif

#define	LCD_TIME_ENA    1.0             // 1µs
#define LCD_TIME_DAT    50.0            // 50µs
#define LCD_TIME_CLR    2000.0          // 2ms
#ifdef LCD_LINE4
#define lcd_set_cursor(x, y)    lcd_command((x) + ((y==3) ? LCD_LINE4 : \
                                           (y==2) ? LCD_LINE3 : \
                                           (y==1) ? LCD_LINE2 : LCD_LINE1 ))
#else
#ifdef LCD_LINE3
#define lcd_set_cursor(x, y)    lcd_command((x) + ((y==2) ? LCD_LINE3 : \
                                           (y==1) ? LCD_LINE2 : LCD_LINE1 ))
#else
#ifdef LCD_LINE2
#define lcd_set_cursor(x, y)    lcd_command((x) + ((y==1) ? LCD_LINE2 : LCD_LINE1 ))
#else
#define lcd_set_cursor(x, y)    lcd_command((x) + LCD_LINE1 )
#endif
#endif
#endif

void lcd_init(void);
void lcd_clear(void);
void lcd_home();
void lcd_putchar(uint8_t d);
#define lcd_putc(c__) lcd_putchar((uint8_t)c__)
void lcd_putstr(int8_t *);
#define lcd_puts(s__) lcd_putstr((int8_t *)s__)
void lcd_putstr_f(int8_t *);
#define lcd_puts_f(s__) lcd_putstr_f((int8_t *)PSTR(s__))
void lcd_putint(int value);
void lcd_putU08(uint8_t value); // display a byte
void lcd_puthexU08(uint8_t value);// display a byte in hex value
void lcd_puthexU16(uint16_t value);// display a word in hex value
void lcd_blank(uint8_t len);// blank n digits
void lcd_cursor_on(void);
void lcd_cursor_off(void);
void lcd_blink_on(void);
void lcd_blink_off(void);
void lcd_display_on(void);
void lcd_display_off(void);

// Private
/*
 static void lcd_nibble( uint8_t d );
 static void lcd_byte( uint8_t d );
 */
void lcd_command(uint8_t d);

// commands
#define LCD_CLEARDISPLAY 0x01
#define LCD_RETURNHOME 0x02
#define LCD_ENTRYMODESET 0x04
#define LCD_DISPLAYCONTROL 0x08
#define LCD_CURSORSHIFT 0x10
#define LCD_FUNCTIONSET 0x20
#define LCD_SETCGRAMADDR 0x40
#define LCD_SETDDRAMADDR 0x80

// flags for display entry mode
#define LCD_ENTRYRIGHT 0x00
#define LCD_ENTRYLEFT 0x02
#define LCD_ENTRYSHIFTINCREMENT 0x01
#define LCD_ENTRYSHIFTDECREMENT 0x00

// flags for display on/off control
#define LCD_DISPLAYON 0x04
#define LCD_DISPLAYOFF 0x00
#define LCD_CURSORON 0x02
#define LCD_CURSOROFF 0x00
#define LCD_BLINKON 0x01
#define LCD_BLINKOFF 0x00

// flags for display/cursor shift
#define LCD_DISPLAYMOVE 0x08
#define LCD_CURSORMOVE 0x00
#define LCD_MOVERIGHT 0x04
#define LCD_MOVELEFT 0x00

// flags for function set
#define LCD_8BITMODE 0x10
#define LCD_4BITMODE 0x00
#define LCD_2LINE 0x08
#define LCD_1LINE 0x00
#define LCD_5x10DOTS 0x04
#define LCD_5x8DOTS 0x00

uint8_t _displayfunction;
uint8_t _displaycontrol;
uint8_t _displaymode;

#endif //ENABLE_LCD
#ifdef ENABLE_GLCD
// this is NOT user zone
// Chips
#define GLCD_CHIP1            0x00
#define GLCD_CHIP2            0x01

// Commands
#define GLCD_ON               0x3F
#define GLCD_OFF              0x3E
#define GLCD_SET_ADD          0x40
#define GLCD_SET_PAGE         0xB8
#define GLCD_DISP_START       0xC0

// Colors
#define GLCD_BLACK            0xFF
#define GLCD_WHITE            0x00

// Font Indices
#define GLCD_FONT_LENGTH         0
#define GLCD_FONT_FIXED_WIDTH    2
#define GLCD_FONT_HEIGHT         3
#define GLCD_FONT_FIRST_CHAR     4
#define GLCD_FONT_CHAR_COUNT     5
#define GLCD_FONT_WIDTH_TABLE    6

// Uncomment for slow drawing
// #define DEBUG

typedef struct {
	uint8_t x;
	uint8_t y;
	uint8_t page;
}glcdCoord;

typedef uint8_t (*ks0108FontCallback)(const uint8_t*);

//
// Function Prototypes
//

